# 問題
# 半径r のお気に入りのボールを手に入れたあなたは、それを収納することができる箱を探しています。

# 今、n 個の箱があり、i (1 ≦ i ≦ n) 番目の箱は高さh_i、幅w_i、奥行きd_i です。各箱においてボールの直径が、箱の高さ、幅、奥行きの3つの長さのうち最も短いもの以下であれば、無事にボールを収納することができます。

# ボールの半径と箱の情報が与えられるので、ボールを収納することができる箱の番号を昇順にすべて答えてください。

# 入力される値
# n r #箱の数n, ボールの半径r 表す整数
# h_1 w_1 d_1 #1個目の箱の高さ、幅、奥行きを表す整数
# h_2 w_2 d_2 #2個目の箱の高さ、幅、奥行きを表す整数
# ...
# h_n w_n d_n #n個目の箱の高さ、幅、奥行きを表す整数

# 入力例1
# 4 2
# 6 6 6
# 4 6 4
# 6 1 1
# 4 4 4
# 出力例1
# 1
# 2
# 4

# 私の回答
n, r = gets.split(' ').map(&:to_i)
ary = []
n.times do |i|
    num = gets.split(' ').map(&:to_i)
    ary << num
end

index = 0
ary.each do |i|
    count = 0
    i.each do |j|
        if j >= r*2
            count += 1
        end
    end
    index += 1
    if count == 3
        puts index
    end
end